99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_future.c
#include "esp32_mquickjs_future.h"

#include "esp32_mquickjs_core.h"
#include "esp32_mquickjs_future_runtime_resources.h"
#include "esp32_mquickjs_future_scheduler.h"
#include "esp32_mquickjs_future_timeout.h"
#include "esp32_mquickjs_options.h"
#include "esp32_mquickjs_memory.h"
#include "esp32_mquickjs_memory_rtos.h"

#include <inttypes.h>
#include <stdio.h>
#include <string.h>

#include "esp_heap_caps.h"
#include "esp_log.h"
#include "esp_timer.h"
#include "freertos/FreeRTOS.h"
#include "freertos/queue.h"
#include "freertos/task.h"

#define ESP32_MQUICKJS_FUTURE_MAX_ARGS 16U
#define ESP32_MQUICKJS_FUTURE_MAX_DRIVERS 256U
#define ESP32_MQUICKJS_FUTURE_DRIVER_CHUNK_SIZE 16U
#define ESP32_MQUICKJS_FUTURE_SLOT_COUNT \
    (CONFIG_ESP32_MQUICKJS_MAX_FUTURES + CONFIG_ESP32_MQUICKJS_INTERNAL_FUTURE_RESERVE)

typedef enum {
    FUTURE_STATE_QUEUED,
    FUTURE_STATE_PENDING,
    FUTURE_STATE_FULFILLED,
    FUTURE_STATE_REJECTED,
    FUTURE_STATE_CANCELLED,
} future_state_t;

typedef enum {
    FUTURE_KIND_CALL,
    FUTURE_KIND_DRIVER,
    FUTURE_KIND_JS_CALL,
    FUTURE_KIND_SLEEP,
    FUTURE_KIND_ALL,
    FUTURE_KIND_RACE,
    FUTURE_KIND_TIMEOUT,
    FUTURE_KIND_MAP,
    FUTURE_KIND_FLAT_MAP,
} future_kind_t;

typedef struct {
    esp32_mquickjs_runtime_t *runtime;
    uint8_t slot;
    uint32_t generation;
    bool terminal;
    bool observed;
    bool rejection_reported;
    bool result_retained;
    future_state_t state;
    JSValue result;
} future_handle_t;

typedef struct {
    JSGCRef function;
    const esp32_mquickjs_future_driver_t *driver;
    bool retained;
} future_driver_entry_t;

typedef struct future_driver_chunk {
    struct future_driver_chunk *next;
    size_t count;
    future_driver_entry_t entries[ESP32_MQUICKJS_FUTURE_DRIVER_CHUNK_SIZE];
} future_driver_chunk_t;

typedef struct {
    esp32_mquickjs_runtime_t *runtime;
    uint8_t slot_id;
    uint32_t generation;
    bool allocated;
    bool call_refs_retained;
    bool result_retained;
    bool input_refs_retained;
    bool driver_active;
    bool driver_started;
    bool lane_waiting;
    bool cancel_requested;
    bool observed;
    future_state_t state;
    future_kind_t kind;
    uint64_t submitted_us;
    uint64_t submission_sequence;
    uint64_t deadline_us;
    JSGCRef function;
    JSGCRef receiver;
    JSGCRef *arguments;
    uint16_t argument_count;
    JSGCRef result;
    JSGCRef *inputs;
    uint16_t input_count;
    esp_timer_handle_t timer;
    const esp32_mquickjs_future_driver_t *driver;
    esp32_mquickjs_future_driver_state_t *driver_state;
    const char *memory_owner;
    esp32_mquickjs_resource_key_t resource_key;
    future_handle_t *handle;
    bool continuation_running;
    bool continuation_called;
} future_slot_t;

typedef struct {
    JSContext *ctx;
    QueueHandle_t submissions;
    QueueHandle_t ready;
    future_slot_t *slots;
    esp32_mquickjs_future_runtime_resources_t resources;
    future_driver_chunk_t *drivers;
    size_t driver_count;
    int running_slot;
    uint64_t next_submission_sequence;
    uint16_t internal_allocation_depth;
    bool shutting_down;
} future_runtime_t;

typedef struct {
    esp32_mquickjs_runtime_t *runtime;
    esp32_mquickjs_future_token_t token;
    esp32_mquickjs_future_worker_fn_t function;
    void *opaque;
    bool wake_future;
} future_worker_item_t;

static const char *TAG = "esp32qjs_future";
static QueueHandle_t s_future_worker_queue;
static bool s_future_worker_pool_initialized;

static void *future_runtime_resource_allocate(size_t count,
                                              size_t size,
                                              void *opaque)
{
    (void)opaque;
    return esp32_mquickjs_memory_shared_runtime_owner() != NULL
        ? esp32_mquickjs_memory_wireless_calloc(esp32_mquickjs_memory_shared_runtime_owner(),
            count, size, ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL)
        : heap_caps_calloc(count, size, MALLOC_CAP_8BIT);
}

static void future_runtime_resource_release(void *value, void *opaque)
{
    (void)opaque;
    esp32_mquickjs_memory_payload_free(value);
}

static void *future_runtime_queue_create(size_t length,
                                         size_t item_size,
                                         void *opaque)
{
    (void)opaque;
    return esp32_mquickjs_memory_queue_create(esp32_mquickjs_memory_shared_runtime_owner(),
        length, item_size, true);
}

static void future_runtime_queue_delete(void *queue, void *opaque)
{
    (void)opaque;
    esp32_mquickjs_memory_queue_delete((QueueHandle_t)queue);
}

static const esp32_mquickjs_future_runtime_resource_ops_t
    s_future_runtime_resource_ops = {
        .allocate = future_runtime_resource_allocate,
        .release = future_runtime_resource_release,
        .queue_create = future_runtime_queue_create,
        .queue_delete = future_runtime_queue_delete,
    };

/* Stacks and TCBs are one fixed boot allocation. Created workers never retire
 * during runtime restart; partial creation retains them and retries the suffix.
 * vTaskDelete on another CPU does not prove its static storage is reusable. */
#define ESP32_MQUICKJS_FUTURE_WORKER_STACK_BYTES 4096U
_Static_assert(sizeof(StackType_t) == 1, "ESP-IDF task stack depth must count bytes");
typedef struct {
    StaticTask_t task;
    StackType_t stack[ESP32_MQUICKJS_FUTURE_WORKER_STACK_BYTES];
} future_worker_storage_t;
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI || CONFIG_ESP32_MQUICKJS_FEATURE_BLE || CONFIG_ESP32_MQUICKJS_FEATURE_ESPNOW
_Static_assert(CONFIG_ESP32_MQUICKJS_WIRELESS_CONTROL_RESERVE_BYTES > 0 &&
    CONFIG_ESP32_MQUICKJS_WIRELESS_CONTROL_RESERVE_BYTES <
        CONFIG_ESP32_MQUICKJS_WIRELESS_INTERNAL_BUDGET_BYTES,
    "Wireless builds require internal control and data headroom");
_Static_assert(CONFIG_ESP32_MQUICKJS_FUTURE_WORKER_POOL_SIZE <=
    (CONFIG_ESP32_MQUICKJS_WIRELESS_INTERNAL_BUDGET_BYTES -
     CONFIG_ESP32_MQUICKJS_WIRELESS_CONTROL_RESERVE_BYTES) / sizeof(future_worker_storage_t),
    "Wireless internal data quota cannot hold the Future worker stacks and TCBs");
#endif
static future_worker_storage_t *s_future_worker_storage;
static size_t s_future_workers_created;

static void future_scheduler_snapshot(
    const future_runtime_t *state,
    esp32_mquickjs_future_scheduler_slot_t *out_slots)
{
    int i;

    if (state == NULL || state->slots == NULL || out_slots == NULL) {
        return;
    }
    for (i = 0; i < ESP32_MQUICKJS_FUTURE_SLOT_COUNT; ++i) {
        const future_slot_t *slot = &state->slots[i];

        out_slots[i].allocated = slot->allocated;
        out_slots[i].driver_active = slot->driver_active;
        out_slots[i].driver_started = slot->driver_started;
        out_slots[i].lane_waiting = slot->lane_waiting;
        out_slots[i].submission_sequence = slot->submission_sequence;
        out_slots[i].resource_key = slot->resource_key;
    }
}

static void future_worker_task(void *opaque)
{
    future_worker_item_t item;

    (void)opaque;
    for (;;) {
        if (xQueueReceive(s_future_worker_queue, &item, portMAX_DELAY) != pdTRUE) {
            continue;
        }
        if (item.function != NULL) {
            item.function(item.opaque);
            if (item.wake_future) {
                (void)esp32_mquickjs_future_wake(item.runtime, item.token);
            }
        }
    }
}

static bool future_init_worker_pool(void)
{
    if (s_future_worker_pool_initialized) return true;
    if (s_future_worker_queue == NULL) {
        s_future_worker_queue = esp32_mquickjs_memory_queue_create(
            esp32_mquickjs_memory_shared_runtime_owner(),
            CONFIG_ESP32_MQUICKJS_FUTURE_WORKER_QUEUE_LEN, sizeof(future_worker_item_t), true);
        if (s_future_worker_queue == NULL) return false;
    }
    if (s_future_worker_storage == NULL) {
        s_future_worker_storage = esp32_mquickjs_memory_shared_runtime_owner() != NULL
            ? esp32_mquickjs_memory_wireless_calloc(esp32_mquickjs_memory_shared_runtime_owner(),
                CONFIG_ESP32_MQUICKJS_FUTURE_WORKER_POOL_SIZE, sizeof(*s_future_worker_storage),
                ESP32_MQUICKJS_MEMORY_PINNED_INTERNAL, ESP32_MQUICKJS_MEMORY_BUDGET_STACK)
            : heap_caps_calloc(CONFIG_ESP32_MQUICKJS_FUTURE_WORKER_POOL_SIZE,
                sizeof(*s_future_worker_storage), MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
        if (s_future_worker_storage == NULL) goto failed;
    }
    while (s_future_workers_created < CONFIG_ESP32_MQUICKJS_FUTURE_WORKER_POOL_SIZE) {
        future_worker_storage_t *storage = &s_future_worker_storage[s_future_workers_created];
        if (xTaskCreateStatic(future_worker_task, "mqjs_io",
            ESP32_MQUICKJS_FUTURE_WORKER_STACK_BYTES, NULL, tskIDLE_PRIORITY + 2,
            storage->stack, &storage->task) == NULL) goto failed;
        ++s_future_workers_created;
    }
    s_future_worker_pool_initialized = true;
    return true;
failed:
    ESP_LOGE(TAG, "Future worker pool initialization failed (%u/%d workers)",
        (unsigned)s_future_workers_created, CONFIG_ESP32_MQUICKJS_FUTURE_WORKER_POOL_SIZE);
    if (s_future_workers_created == 0) {
        esp32_mquickjs_memory_queue_delete(s_future_worker_queue);
        s_future_worker_queue = NULL;
        esp32_mquickjs_memory_payload_free(s_future_worker_storage);
        s_future_worker_storage = NULL;
    }
    return false;
}

static future_runtime_t *future_runtime(esp32_mquickjs_runtime_t *runtime)
{
    return runtime != NULL ? runtime->future_state : NULL;
}

