99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_future.c
static bool future_is_terminal(future_state_t state)
{
    return state == FUTURE_STATE_FULFILLED ||
           state == FUTURE_STATE_REJECTED ||
           state == FUTURE_STATE_CANCELLED;
}

static const char *future_state_name(future_state_t state)
{
    switch (state) {
        case FUTURE_STATE_QUEUED:
            return "queued";
        case FUTURE_STATE_PENDING:
            return "pending";
        case FUTURE_STATE_FULFILLED:
            return "fulfilled";
        case FUTURE_STATE_REJECTED:
            return "rejected";
        case FUTURE_STATE_CANCELLED:
            return "cancelled";
        default:
            return "cancelled";
    }
}

static future_slot_t *future_resolve_token(esp32_mquickjs_runtime_t *runtime,
                                           esp32_mquickjs_future_token_t token)
{
    future_runtime_t *state = future_runtime(runtime);
    future_slot_t *slot;

    if (state == NULL || state->slots == NULL ||
        token.slot >= ESP32_MQUICKJS_FUTURE_SLOT_COUNT) {
        return NULL;
    }
    slot = &state->slots[token.slot];
    return slot->allocated && slot->generation == token.generation ? slot : NULL;
}

static esp32_mquickjs_future_token_t future_token(const future_slot_t *slot)
{
    esp32_mquickjs_future_token_t token = {0};

    if (slot != NULL) {
        token.slot = slot->slot_id;
        token.generation = slot->generation;
    }
    return token;
}

static void *future_control_allocate(future_slot_t *slot, size_t count, size_t size)
{
    return slot->memory_owner != NULL
        ? esp32_mquickjs_memory_wireless_calloc(slot->memory_owner, count, size,
            ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL)
        : heap_caps_calloc(count, size, MALLOC_CAP_8BIT);
}

static void future_release_call_refs(JSContext *ctx, future_slot_t *slot)
{
    int i;

    if (slot == NULL || !slot->call_refs_retained) {
        return;
    }
    for (i = (int)slot->argument_count - 1; i >= 0; --i) {
        JS_DeleteGCRef(ctx, &slot->arguments[i]);
    }
    esp32_mquickjs_memory_payload_free(slot->arguments);
    slot->arguments = NULL;
    slot->argument_count = 0;
    JS_DeleteGCRef(ctx, &slot->receiver);
    JS_DeleteGCRef(ctx, &slot->function);
    slot->call_refs_retained = false;
}

static void future_release_input_refs(JSContext *ctx, future_slot_t *slot)
{
    int i;

    if (slot == NULL || !slot->input_refs_retained) {
        return;
    }
    for (i = (int)slot->input_count - 1; i >= 0; --i) {
        JS_DeleteGCRef(ctx, &slot->inputs[i]);
    }
    esp32_mquickjs_memory_payload_free(slot->inputs);
    slot->inputs = NULL;
    slot->input_count = 0;
    slot->input_refs_retained = false;
}

static void future_stop_timer(future_slot_t *slot)
{
    if (slot == NULL || slot->timer == NULL) {
        return;
    }
    (void)esp_timer_stop(slot->timer);
    (void)esp_timer_delete(slot->timer);
    slot->timer = NULL;
}

static void future_destroy_driver(future_slot_t *slot)
{
    if (slot == NULL || !slot->driver_active) {
        return;
    }
    if (slot->driver != NULL && slot->driver->destroy != NULL) {
        slot->driver->destroy(slot->driver_state);
    }
    slot->driver_state = NULL;
    slot->driver = NULL;
    slot->driver_active = false;
    slot->driver_started = false;
    slot->lane_waiting = false;
    slot->resource_key = NULL;
}

static void future_clear_slot(JSContext *ctx, future_slot_t *slot)
{
    uint8_t slot_id;
    uint32_t generation;
    esp32_mquickjs_runtime_t *runtime;

    if (slot == NULL || !slot->allocated) {
        return;
    }
    slot_id = slot->slot_id;
    generation = slot->generation;
    runtime = slot->runtime;
    future_stop_timer(slot);
    future_destroy_driver(slot);
    future_release_call_refs(ctx, slot);
    future_release_input_refs(ctx, slot);
    if (slot->result_retained) {
        JS_DeleteGCRef(ctx, &slot->result);
    }
    memset(slot, 0, sizeof(*slot));
    slot->slot_id = slot_id;
    slot->generation = generation;
    slot->runtime = runtime;
}

static void future_report_unobserved(JSContext *ctx, future_handle_t *handle)
{
    if (handle == NULL || !handle->terminal || handle->state != FUTURE_STATE_REJECTED ||
        handle->observed || handle->rejection_reported || !handle->result_retained) {
        return;
    }
    handle->rejection_reported = true;
    (void)JS_Throw(ctx, handle->result);
    esp32_mquickjs_print_exception(ctx);
}

static void future_release_if_terminal(JSContext *ctx, future_slot_t *slot)
{
    if (slot == NULL || !slot->allocated || !future_is_terminal(slot->state) ||
        slot->driver_active) {
        return;
    }
    future_clear_slot(ctx, slot);
}

static void future_publish_terminal(JSContext *ctx, future_slot_t *slot)
{
    future_handle_t *handle;

    if (slot == NULL || !slot->allocated || !future_is_terminal(slot->state)) {
        return;
    }
    handle = slot->handle;
    if (handle == NULL) {
        if (slot->state == FUTURE_STATE_REJECTED && !slot->observed &&
            slot->result_retained) {
            (void)JS_Throw(ctx, slot->result.val);
            esp32_mquickjs_print_exception(ctx);
        }
        return;
    }
    handle->terminal = true;
    handle->observed = handle->observed || slot->observed;
    handle->state = slot->state;
    if (slot->result_retained) {
        handle->result = slot->result.val;
        handle->result_retained = true;
    }
    slot->handle = NULL;
}

static void future_store_result(JSContext *ctx, future_slot_t *slot, JSValue value)
{
    JSValue *rooted;

    if (slot->result_retained) {
        JS_DeleteGCRef(ctx, &slot->result);
    }
    rooted = JS_AddGCRef(ctx, &slot->result);
    *rooted = value;
    slot->result_retained = true;
}

static void future_settle(JSContext *ctx,
                          future_slot_t *slot,
                          future_state_t state,
                          JSValue value)
{
    if (slot == NULL || !slot->allocated || future_is_terminal(slot->state)) {
        return;
    }
    if (state == FUTURE_STATE_FULFILLED || state == FUTURE_STATE_REJECTED) {
        future_store_result(ctx, slot, value);
    }
    slot->state = state;
    future_release_call_refs(ctx, slot);
    future_release_input_refs(ctx, slot);
    future_stop_timer(slot);
    future_publish_terminal(ctx, slot);
    future_release_if_terminal(ctx, slot);
}

static void future_reject_current_exception(JSContext *ctx, future_slot_t *slot)
{
    JSValue exception = JS_GetException(ctx);

