99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_future.c
    if (JS_IsUndefined(exception)) {
        exception = JS_NewString(ctx, "Future operation failed");
    }
    future_settle(ctx, slot, FUTURE_STATE_REJECTED, exception);
}

static void future_reject_message(JSContext *ctx, future_slot_t *slot, const char *message)
{
    future_settle(ctx,
                  slot,
                  FUTURE_STATE_REJECTED,
                  JS_NewString(ctx, message != NULL ? message : "Future operation failed"));
}

static future_slot_t *future_find_free_slot(future_runtime_t *state,
                                            bool internal)
{
    esp32_mquickjs_future_scheduler_slot_t
        slots[ESP32_MQUICKJS_FUTURE_SLOT_COUNT];
    size_t index;

    if (state == NULL || state->slots == NULL) {
        return NULL;
    }
    future_scheduler_snapshot(state, slots);
    index = esp32_mquickjs_future_scheduler_find_free(
        slots, ESP32_MQUICKJS_FUTURE_SLOT_COUNT,
        CONFIG_ESP32_MQUICKJS_MAX_FUTURES, internal);
    return index != ESP32_MQUICKJS_FUTURE_SCHEDULER_NO_SLOT
               ? &state->slots[index]
               : NULL;
}

static future_slot_t *future_allocate_slot(esp32_mquickjs_runtime_t *runtime,
                                           future_kind_t kind)
{
    future_runtime_t *state = future_runtime(runtime);
    future_slot_t *slot;
    bool internal;

    if (state == NULL || state->shutting_down) {
        return NULL;
    }
    internal = state->internal_allocation_depth > 0;
    slot = future_find_free_slot(state, internal);
    if (slot == NULL) {
        return NULL;
    }
    slot->generation++;
    if (slot->generation == 0) {
        slot->generation++;
    }
    slot->allocated = true;
    slot->memory_owner = esp32_mquickjs_memory_shared_runtime_owner();
    slot->kind = kind;
    slot->state = FUTURE_STATE_QUEUED;
    slot->submitted_us = (uint64_t)esp_timer_get_time();
    slot->submission_sequence = ++state->next_submission_sequence;
    slot->deadline_us = runtime->scoped_deadline_us;
    return slot;
}

static JSValue future_make_handle(JSContext *ctx, future_slot_t *slot)
{
    future_handle_t *handle;
    JSGCRef object_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    JSValue result;

    *object = JS_NewObjectClassUser(ctx, JS_CLASS_FUTURE);
    if (JS_IsException(*object)) {
        future_clear_slot(ctx, slot);
        return JS_PopGCRef(ctx, &object_ref);
    }
    handle = future_control_allocate(slot, 1, sizeof(*handle));
    if (handle == NULL) {
        future_clear_slot(ctx, slot);
        result = JS_ThrowOutOfMemory(ctx);
        JS_PopGCRef(ctx, &object_ref);
        return result;
    }
    handle->runtime = slot->runtime;
    handle->slot = slot->slot_id;
    handle->generation = slot->generation;
    handle->state = slot->state;
    handle->result = JS_UNDEFINED;
    slot->handle = handle;
    JS_SetOpaque(ctx, *object, handle);
    return JS_PopGCRef(ctx, &object_ref);
}

static void future_abandon_handle(future_slot_t *slot)
{
    if (slot == NULL || slot->handle == NULL) {
        return;
    }
    /* The JS object owns the handle until MQuickJS runs its finalizer. */
    slot->handle = NULL;
}

static bool future_submit(future_slot_t *slot)
{
    future_runtime_t *state;
    esp32_mquickjs_future_token_t token;
    UBaseType_t queued_count;
    UBaseType_t i;

    if (slot == NULL) {
        return false;
    }
    state = future_runtime(slot->runtime);
    token = future_token(slot);
    if (state == NULL || state->submissions == NULL) {
        return false;
    }
    if (xQueueSend(state->submissions, &token, 0) != pdTRUE) {
        esp32_mquickjs_future_token_t queued_token;

        queued_count = uxQueueMessagesWaiting(state->submissions);
        for (i = 0; i < queued_count; ++i) {
            future_slot_t *queued_slot;

            if (xQueueReceive(state->submissions, &queued_token, 0) != pdTRUE) {
                break;
            }
            queued_slot = future_resolve_token(slot->runtime, queued_token);
            if (queued_slot != NULL && queued_slot->state == FUTURE_STATE_QUEUED) {
                (void)xQueueSend(state->submissions, &queued_token, 0);
            }
        }
        if (xQueueSend(state->submissions, &token, 0) != pdTRUE) {
            return false;
        }
    }
    esp32_mquickjs_notify_activity(slot->runtime);
    return true;
}

static future_handle_t *future_handle_from_value(JSContext *ctx, JSValue value)
{
    future_handle_t *handle;

    if (JS_GetClassID(ctx, value) != JS_CLASS_FUTURE) {
        return NULL;
    }
    handle = JS_GetOpaque(ctx, value);
    if (handle == NULL) {
        return NULL;
    }
    return handle;
}

static future_slot_t *future_handle_slot(future_handle_t *handle)
{
    if (handle == NULL || handle->terminal) {
        return NULL;
    }
    return future_resolve_token(handle->runtime,
                                (esp32_mquickjs_future_token_t){
                                    .slot = handle->slot,
                                    .generation = handle->generation,
                                });
}

static void future_mark_observed(future_handle_t *handle)
{
    future_slot_t *slot;

    if (handle == NULL) {
        return;
    }
    handle->observed = true;
    slot = future_handle_slot(handle);
    if (slot != NULL) {
        slot->observed = true;
    }
}

static future_handle_t *future_this_handle(JSContext *ctx,
                                           JSValue *this_val,
                                           const char *api_name)
{
    future_handle_t *handle = this_val != NULL
        ? future_handle_from_value(ctx, *this_val) : NULL;

    if (handle == NULL || (!handle->terminal && future_handle_slot(handle) == NULL)) {
        JS_ThrowTypeError(ctx, "%s expects a live Future", api_name);
    }
    return handle;
}

static int future_array_length(JSContext *ctx, JSValue array, uint32_t *out_length)
{
    JSValue length_value;
    int result;

    if (JS_GetClassID(ctx, array) != JS_CLASS_ARRAY) {
        return -1;
    }
    length_value = JS_GetPropertyStr(ctx, array, "length");
    if (JS_IsException(length_value)) {
        return -1;
    }
    result = JS_ToUint32(ctx, out_length, length_value);
    return result;
}

static bool future_retain_call(JSContext *ctx,
                               future_slot_t *slot,
                               JSValue function,
                               JSValue receiver,
                               JSValue args_array)
{
    JSGCRef function_ref;
    JSGCRef receiver_ref;
    JSGCRef args_ref;
    JSValue *rooted_function;
    JSValue *rooted_receiver;
    JSValue *rooted_args;
    uint32_t argument_count = 0;
    JSValue *ref;
    uint32_t i;
    bool retained = false;

    rooted_function = JS_PushGCRef(ctx, &function_ref);
    rooted_receiver = JS_PushGCRef(ctx, &receiver_ref);
    rooted_args = JS_PushGCRef(ctx, &args_ref);
    *rooted_function = function;
    *rooted_receiver = receiver;
    *rooted_args = args_array;

