99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_future.c
    if (!JS_IsUndefined(*rooted_args) &&
        future_array_length(ctx, *rooted_args, &argument_count) != 0) {
        JS_ThrowTypeError(ctx, "Future.call(fn, thisValue?, args?) expects args to be an array");
        goto done;
    }
    if (argument_count > ESP32_MQUICKJS_FUTURE_MAX_ARGS) {
        JS_ThrowRangeError(ctx,
                           "Future.call() supports at most %u arguments",
                           (unsigned)ESP32_MQUICKJS_FUTURE_MAX_ARGS);
        goto done;
    }
    if (argument_count > 0) {
        slot->arguments = future_control_allocate(slot, argument_count, sizeof(*slot->arguments));
        if (slot->arguments == NULL) {
            JS_ThrowOutOfMemory(ctx);
            goto done;
        }
    }

    ref = JS_AddGCRef(ctx, &slot->function);
    *ref = *rooted_function;
    ref = JS_AddGCRef(ctx, &slot->receiver);
    *ref = *rooted_receiver;
    slot->call_refs_retained = true;
    slot->argument_count = 0;

    for (i = 0; i < argument_count; ++i) {
        JSValue value = JS_GetPropertyUint32(ctx, *rooted_args, i);

        if (JS_IsException(value)) {
            goto done;
        }
        ref = JS_AddGCRef(ctx, &slot->arguments[i]);
        *ref = value;
        slot->argument_count++;
    }
    retained = true;

done:
    JS_PopGCRef(ctx, &args_ref);
    JS_PopGCRef(ctx, &receiver_ref);
    JS_PopGCRef(ctx, &function_ref);
    return retained;
}

static bool future_retain_inputs(JSContext *ctx,
                                 future_slot_t *slot,
                                 JSValue inputs_array,
                                 bool allow_empty)
{
    JSGCRef inputs_ref;
    JSValue *rooted_inputs;
    uint32_t input_count = 0;
    uint32_t i;
    bool retained = false;

    rooted_inputs = JS_PushGCRef(ctx, &inputs_ref);
    *rooted_inputs = inputs_array;
    if (future_array_length(ctx, *rooted_inputs, &input_count) != 0) {
        JS_ThrowTypeError(ctx, "Future combinator expects an array of Futures");
        goto done;
    }
    if (!allow_empty && input_count == 0) {
        JS_ThrowRangeError(ctx, "Future.race() expects at least one Future");
        goto done;
    }
    if (input_count > CONFIG_ESP32_MQUICKJS_MAX_FUTURES) {
        JS_ThrowRangeError(ctx,
                           "Future combinator supports at most %u inputs",
                           (unsigned)CONFIG_ESP32_MQUICKJS_MAX_FUTURES);
        goto done;
    }
    if (input_count > 0) {
        slot->inputs = future_control_allocate(slot, input_count, sizeof(*slot->inputs));
        if (slot->inputs == NULL) {
            JS_ThrowOutOfMemory(ctx);
            goto done;
        }
    }
    slot->input_count = 0;
    slot->input_refs_retained = true;
    for (i = 0; i < input_count; ++i) {
        JSValue value = JS_GetPropertyUint32(ctx, *rooted_inputs, i);
        JSValue *rooted;

        if (JS_IsException(value) || future_handle_from_value(ctx, value) == NULL) {
            if (!JS_IsException(value)) {
                JS_ThrowTypeError(ctx, "Future combinator input %u is not a live Future", (unsigned)i);
            }
            goto done;
        }
        rooted = JS_AddGCRef(ctx, &slot->inputs[i]);
        *rooted = value;
        slot->input_count++;
    }
    retained = true;

done:
    JS_PopGCRef(ctx, &inputs_ref);
    return retained;
}

static bool future_retain_continuation(JSContext *ctx,
                                       future_slot_t *slot,
                                       JSValue input,
                                       JSValue callback)
{
    JSValue *rooted;

    if (slot == NULL || future_handle_from_value(ctx, input) == NULL ||
        !JS_IsFunction(ctx, callback)) {
        JS_ThrowTypeError(ctx, "Future continuation expects a live Future and a function");
        return false;
    }
    slot->inputs = future_control_allocate(slot, 1, sizeof(*slot->inputs));
    if (slot->inputs == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    rooted = JS_AddGCRef(ctx, &slot->inputs[0]);
    *rooted = input;
    slot->input_count = 1;
    slot->input_refs_retained = true;
    rooted = JS_AddGCRef(ctx, &slot->function);
    *rooted = callback;
    rooted = JS_AddGCRef(ctx, &slot->receiver);
    *rooted = JS_UNDEFINED;
    slot->call_refs_retained = true;
    return true;
}

static void future_observe_inputs(JSContext *ctx, future_slot_t *slot)
{
    uint16_t i;

    if (slot == NULL) {
        return;
    }
    /* Promise-style combinators attach a rejection handler to every input. */
    for (i = 0; i < slot->input_count; ++i) {
        future_mark_observed(future_handle_from_value(ctx, slot->inputs[i].val));
    }
}

static const esp32_mquickjs_future_driver_t *future_find_driver(future_runtime_t *state,
                                                                JSValue function)
{
    if (state == NULL) {
        return NULL;
    }
    for (future_driver_chunk_t *chunk = state->drivers; chunk != NULL; chunk = chunk->next) {
        for (size_t i = 0; i < chunk->count; ++i) {
            if (chunk->entries[i].retained && chunk->entries[i].function.val == function) {
                return chunk->entries[i].driver;
            }
        }
    }
    return NULL;
}

static void future_clear_driver_registry(JSContext *ctx, future_runtime_t *state)
{
    future_driver_chunk_t *chunk = state->drivers;
    state->drivers = NULL;
    state->driver_count = 0;
    while (chunk != NULL) {
        future_driver_chunk_t *next = chunk->next;
        if (ctx != NULL) {
            for (size_t i = 0; i < chunk->count; ++i) {
                if (chunk->entries[i].retained) JS_DeleteGCRef(ctx, &chunk->entries[i].function);
            }
        }
        future_runtime_resource_release(chunk, NULL);
        chunk = next;
    }
}

static void future_apply_driver_deadline(future_slot_t *slot)
{
    uint32_t timeout_ms;
    uint64_t deadline_us;

    if (slot == NULL || slot->driver == NULL || slot->driver->timeout_ms == NULL) {
        return;
    }
    timeout_ms = slot->driver->timeout_ms(slot->driver_state);
    if (timeout_ms == 0) {
        return;
    }
    deadline_us = slot->submitted_us + ((uint64_t)timeout_ms * 1000ULL);
    if (slot->deadline_us == 0 || deadline_us < slot->deadline_us) {
        slot->deadline_us = deadline_us;
    }
}

static bool future_capture_call_driver(JSContext *ctx,
                                       future_runtime_t *state,
                                       future_slot_t *slot)
{
    const esp32_mquickjs_future_driver_t *driver;

    if (slot == NULL || !slot->call_refs_retained) {
        return false;
    }
    driver = future_find_driver(state, slot->function.val);
    if (driver == NULL) {
        return true;
    }
    slot->driver = driver;
    slot->kind = FUTURE_KIND_DRIVER;
    if (driver->capture == NULL ||
        !driver->capture(ctx,
                         &slot->receiver,
                         slot->argument_count,
                         slot->arguments,
                         &slot->driver_state)) {
        slot->driver = NULL;
        slot->kind = FUTURE_KIND_CALL;
        future_reject_current_exception(ctx, slot);
        return false;
    }
    slot->driver_active = true;
    slot->resource_key = driver->resource_key != NULL
        ? driver->resource_key(slot->driver_state) : NULL;
    future_apply_driver_deadline(slot);
    future_release_call_refs(ctx, slot);
    return true;
}

static esp32_mquickjs_future_lane_admission_t future_lane_admission(
    const future_runtime_t *state,
    const future_slot_t *candidate)
{
    esp32_mquickjs_future_scheduler_slot_t
        slots[ESP32_MQUICKJS_FUTURE_SLOT_COUNT];

    if (state == NULL || candidate == NULL ||
        candidate->slot_id >= ESP32_MQUICKJS_FUTURE_SLOT_COUNT) {
        return ESP32_MQUICKJS_FUTURE_LANE_REJECT;
    }
    future_scheduler_snapshot(state, slots);
    return esp32_mquickjs_future_scheduler_lane_admission(
        slots, ESP32_MQUICKJS_FUTURE_SLOT_COUNT, candidate->slot_id,
        CONFIG_ESP32_MQUICKJS_FUTURE_RESOURCE_LANE_QUEUE_LEN);
}

static bool future_start_captured_driver(JSContext *ctx,
                                         esp32_mquickjs_runtime_t *runtime,
                                         future_slot_t *slot)
{
    if (slot == NULL || slot->state != FUTURE_STATE_QUEUED ||
        !slot->driver_active || slot->driver == NULL ||
        slot->driver_state == NULL || slot->driver->start == NULL) {
        return false;
    }
    slot->lane_waiting = false;
    slot->driver_started = true;
    slot->state = FUTURE_STATE_PENDING;
    if (!slot->driver->start(ctx, runtime, future_token(slot),
                             slot->driver_state)) {
        future_reject_current_exception(ctx, slot);
        future_destroy_driver(slot);
        future_release_if_terminal(ctx, slot);
    }
    return true;
}

static void future_dispatch_call(JSContext *ctx,
                                 esp32_mquickjs_runtime_t *runtime,
                                 future_slot_t *slot)
{
    future_runtime_t *state = future_runtime(runtime);
    JSValue *argv = NULL;
    uint64_t saved_deadline_us;
    JSValue result;
    int i;

    if (slot == NULL || slot->state != FUTURE_STATE_QUEUED) {
        return;
    }
    if (slot->kind == FUTURE_KIND_DRIVER) {
        esp32_mquickjs_future_lane_admission_t admission;

        if (!slot->driver_active || slot->driver == NULL ||
            slot->driver_state == NULL || slot->driver->start == NULL) {
            future_reject_message(ctx, slot, "Future native driver was not captured");
            future_destroy_driver(slot);
            future_release_if_terminal(ctx, slot);
            return;
        }
        admission = future_lane_admission(state, slot);
        if (admission == ESP32_MQUICKJS_FUTURE_LANE_REJECT) {
            future_reject_message(ctx, slot,
                                  "Future resource lane queue is full");
            future_destroy_driver(slot);
            future_release_if_terminal(ctx, slot);
            return;
        }
        if (admission == ESP32_MQUICKJS_FUTURE_LANE_WAIT) {
            slot->lane_waiting = true;
            return;
        }
        if (!future_start_captured_driver(ctx, runtime, slot)) {
            future_reject_message(ctx, slot, "Future native driver failed to start");
            future_destroy_driver(slot);
            future_release_if_terminal(ctx, slot);
        }
        return;
    }
    if (slot->kind != FUTURE_KIND_CALL || !slot->call_refs_retained) {
        future_reject_message(ctx, slot, "Future has an invalid call operation");
        return;
    }

