99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_future.c
    if (slot->argument_count > 0) {
        argv = future_control_allocate(slot, slot->argument_count, sizeof(*argv));
        if (argv == NULL) {
            future_reject_message(ctx, slot, "Future dispatch ran out of memory");
            return;
        }
        for (i = 0; i < slot->argument_count; ++i) {
            argv[i] = slot->arguments[i].val;
        }
    }

    slot->kind = FUTURE_KIND_JS_CALL;
    slot->state = FUTURE_STATE_PENDING;
    state->running_slot = slot->slot_id;
    saved_deadline_us = runtime->deadline_us;
    if (slot->deadline_us > 0 &&
        (runtime->deadline_us == 0 || slot->deadline_us < runtime->deadline_us)) {
        runtime->deadline_us = slot->deadline_us;
    }
    result = esp32_mquickjs_call(ctx,
                                 runtime,
                                 slot->function.val,
                                 slot->receiver.val,
                                 slot->argument_count,
                                 argv);
    runtime->deadline_us = saved_deadline_us;
    state->running_slot = -1;
    esp32_mquickjs_memory_payload_free(argv);
    future_release_call_refs(ctx, slot);
    if (future_is_terminal(slot->state)) {
        if (JS_IsException(result)) {
            (void)JS_GetException(ctx);
        }
        future_publish_terminal(ctx, slot);
        future_release_if_terminal(ctx, slot);
    } else if (JS_IsException(result)) {
        future_reject_current_exception(ctx, slot);
    } else {
        future_settle(ctx, slot, FUTURE_STATE_FULFILLED, result);
    }
}

static void future_sleep_timer_callback(void *opaque)
{
    future_slot_t *slot = opaque;

    if (slot != NULL && slot->allocated) {
        (void)esp32_mquickjs_future_wake(slot->runtime, future_token(slot));
    }
}

static void future_start_sleep(JSContext *ctx, future_slot_t *slot)
{
    esp_timer_create_args_t args = {0};
    uint64_t now_us = (uint64_t)esp_timer_get_time();
    uint64_t remaining_us;

    slot->state = FUTURE_STATE_PENDING;
    if (slot->deadline_us <= now_us) {
        future_settle(ctx, slot, FUTURE_STATE_FULFILLED, JS_UNDEFINED);
        return;
    }
    remaining_us = slot->deadline_us - now_us;
    args.callback = future_sleep_timer_callback;
    args.arg = slot;
    args.dispatch_method = ESP_TIMER_TASK;
    args.name = "mqjs_future";
    args.skip_unhandled_events = true;
    if (esp_timer_create(&args, &slot->timer) != ESP_OK ||
        esp_timer_start_once(slot->timer, remaining_us) != ESP_OK) {
        future_stop_timer(slot);
        future_reject_message(ctx, slot, "Future.sleep() failed to start timer");
    }
}

static void future_dispatch_submission(JSContext *ctx,
                                       esp32_mquickjs_runtime_t *runtime,
                                       future_slot_t *slot)
{
    if (slot == NULL || slot->state != FUTURE_STATE_QUEUED) {
        return;
    }
    switch (slot->kind) {
        case FUTURE_KIND_CALL:
        case FUTURE_KIND_DRIVER:
            future_dispatch_call(ctx, runtime, slot);
            break;
        case FUTURE_KIND_SLEEP:
            future_start_sleep(ctx, slot);
            break;
        case FUTURE_KIND_ALL:
        case FUTURE_KIND_RACE:
        case FUTURE_KIND_TIMEOUT:
        case FUTURE_KIND_MAP:
        case FUTURE_KIND_FLAT_MAP:
            slot->state = FUTURE_STATE_PENDING;
            break;
        default:
            future_reject_message(ctx, slot, "Future has an invalid queued operation");
            break;
    }
}

static future_state_t future_handle_state(future_handle_t *handle)
{
    future_slot_t *slot;

    if (handle == NULL) {
        return FUTURE_STATE_CANCELLED;
    }
    if (handle->terminal) {
        return handle->state;
    }
    slot = future_handle_slot(handle);
    return slot != NULL ? slot->state : FUTURE_STATE_CANCELLED;
}

static JSValue future_handle_result(future_handle_t *handle)
{
    future_slot_t *slot;

    if (handle == NULL) {
        return JS_UNDEFINED;
    }
    if (handle->terminal) {
        return handle->result_retained ? handle->result : JS_UNDEFINED;
    }
    slot = future_handle_slot(handle);
    return slot != NULL && slot->result_retained ? slot->result.val : JS_UNDEFINED;
}

static void future_copy_terminal(JSContext *ctx,
                                 future_slot_t *target,
                                 future_handle_t *source)
{
    future_state_t state = future_handle_state(source);

    if (source != NULL) {
        future_mark_observed(source);
    }
    if (state == FUTURE_STATE_FULFILLED) {
        future_settle(ctx, target, FUTURE_STATE_FULFILLED, future_handle_result(source));
    } else if (state == FUTURE_STATE_REJECTED) {
        future_settle(ctx, target, FUTURE_STATE_REJECTED, future_handle_result(source));
    } else if (state == FUTURE_STATE_CANCELLED) {
        future_settle(ctx, target, FUTURE_STATE_CANCELLED, JS_UNDEFINED);
    }
}

static void future_advance_all(JSContext *ctx, future_slot_t *slot)
{
    JSGCRef results_ref;
    JSValue *results;
    uint16_t i;

    for (i = 0; i < slot->input_count; ++i) {
        future_handle_t *input = future_handle_from_value(ctx, slot->inputs[i].val);
        future_state_t state;

        if (input == NULL) {
            future_reject_message(ctx, slot, "Future.all() input became stale");
            return;
        }
        state = future_handle_state(input);
        if (state == FUTURE_STATE_REJECTED || state == FUTURE_STATE_CANCELLED) {
            future_copy_terminal(ctx, slot, input);
            return;
        }
        if (state != FUTURE_STATE_FULFILLED) {
            return;
        }
    }

    results = JS_PushGCRef(ctx, &results_ref);
    *results = JS_NewArray(ctx, slot->input_count);
    if (JS_IsException(*results)) {
        JS_PopGCRef(ctx, &results_ref);
        future_reject_current_exception(ctx, slot);
        return;
    }
    for (i = 0; i < slot->input_count; ++i) {
        future_handle_t *input = future_handle_from_value(ctx, slot->inputs[i].val);

        if (input == NULL ||
            JS_IsException(JS_SetPropertyUint32(ctx, *results, i,
                                                future_handle_result(input)))) {
            JS_PopGCRef(ctx, &results_ref);
            future_reject_current_exception(ctx, slot);
            return;
        }
    }
    future_settle(ctx, slot, FUTURE_STATE_FULFILLED, *results);
    JS_PopGCRef(ctx, &results_ref);
}

static void future_advance_race(JSContext *ctx, future_slot_t *slot)
{
    uint16_t i;

    for (i = 0; i < slot->input_count; ++i) {
        future_handle_t *input = future_handle_from_value(ctx, slot->inputs[i].val);
        future_state_t state;

        if (input == NULL) {
            future_reject_message(ctx, slot, "Future.race() input became stale");
            return;
        }
        state = future_handle_state(input);
        if (!future_is_terminal(state)) {
            continue;
        }
        if (state == FUTURE_STATE_FULFILLED) {
            JSGCRef result_ref;
            JSValue *result = JS_PushGCRef(ctx, &result_ref);

            *result = JS_NewObject(ctx);
            if (JS_IsException(*result) ||
                !esp32_mquickjs_set_property_ref(ctx, result, "index", JS_NewUint32(ctx, i)) ||
                !esp32_mquickjs_set_property_ref(ctx, result, "value",
                                                future_handle_result(input))) {
                JS_PopGCRef(ctx, &result_ref);
                future_reject_current_exception(ctx, slot);
                return;
            }
            future_settle(ctx, slot, FUTURE_STATE_FULFILLED, *result);
            JS_PopGCRef(ctx, &result_ref);
        } else {
            future_copy_terminal(ctx, slot, input);
        }
        return;
    }
}

static bool future_cancel_slot(JSContext *ctx, future_slot_t *slot)
{
    esp32_mquickjs_cancel_result_t result;

    if (slot == NULL || future_is_terminal(slot->state)) {
        return false;
    }
    if (slot->state == FUTURE_STATE_QUEUED) {
        future_destroy_driver(slot);
        future_settle(ctx, slot, FUTURE_STATE_CANCELLED, JS_UNDEFINED);
        return true;
    }
    if (slot->driver_active) {
        if (slot->cancel_requested || slot->driver == NULL ||
            slot->driver->cancel == NULL) {
            return false;
        }
        result = slot->driver->cancel(slot->driver_state);
        if (result == ESP32_MQUICKJS_CANCEL_REJECTED) {
            return false;
        }
        if (result == ESP32_MQUICKJS_CANCEL_REQUESTED) {
            slot->cancel_requested = true;
            return true;
        }
    }
    future_settle(ctx, slot, FUTURE_STATE_CANCELLED, JS_UNDEFINED);
    return true;
}

