99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_future.c
static void future_advance_timeout(JSContext *ctx, future_slot_t *slot, uint64_t now_us)
{
    future_handle_t *input;
    future_slot_t *input_slot;
    future_state_t input_state;

    if (slot->input_count != 1) {
        future_reject_message(ctx, slot, "Future.timeout() lost its input");
        return;
    }
    input = future_handle_from_value(ctx, slot->inputs[0].val);
    if (input == NULL) {
        future_reject_message(ctx, slot, "Future.timeout() input became stale");
        return;
    }
    input_state = future_handle_state(input);
    if (future_is_terminal(input_state)) {
        future_copy_terminal(ctx, slot, input);
    } else if (slot->deadline_us > 0 && now_us >= slot->deadline_us) {
        char message[96];
        uint32_t timeout_ms = esp32_mquickjs_future_elapsed_timeout_ms(
            slot->submitted_us, slot->deadline_us);

        input_slot = future_handle_slot(input);
        if (input_slot != NULL) {
            future_mark_observed(input);
            (void)future_cancel_slot(ctx, input_slot);
        }
        snprintf(message, sizeof(message), "Future.timeout() expired after %" PRIu32 " ms", timeout_ms);
        future_reject_message(ctx, slot, message);
    }
}

static void future_advance_continuation(JSContext *ctx,
                                        esp32_mquickjs_runtime_t *runtime,
                                        future_slot_t *slot)
{
    future_handle_t *input;
    future_state_t input_state;
    JSValue result;
    JSValue argument;

    if (slot->input_count != 1) {
        future_reject_message(ctx, slot, "Future continuation lost its input");
        return;
    }
    input = future_handle_from_value(ctx, slot->inputs[0].val);
    if (input == NULL) {
        future_reject_message(ctx, slot, "Future continuation input became stale");
        return;
    }
    input_state = future_handle_state(input);
    if (!future_is_terminal(input_state)) {
        return;
    }
    future_mark_observed(input);
    if (input_state != FUTURE_STATE_FULFILLED) {
        future_copy_terminal(ctx, slot, input);
        return;
    }
    if (slot->continuation_running) {
        return;
    }
    if (slot->continuation_called) {
        future_copy_terminal(ctx, slot, input);
        return;
    }

    argument = future_handle_result(input);
    slot->continuation_running = true;
    result = esp32_mquickjs_call(ctx,
                                 runtime,
                                 slot->function.val,
                                 JS_UNDEFINED,
                                 1,
                                 &argument);
    slot->continuation_running = false;
    slot->continuation_called = true;
    if (JS_IsException(result)) {
        future_reject_current_exception(ctx, slot);
        return;
    }
    if (slot->kind == FUTURE_KIND_MAP) {
        future_settle(ctx, slot, FUTURE_STATE_FULFILLED, result);
        return;
    }

    input = future_handle_from_value(ctx, result);
    if (input == NULL) {
        future_reject_message(ctx, slot, "future.flatMap() callback must return a Future");
        return;
    }
    JS_DeleteGCRef(ctx, &slot->inputs[0]);
    *JS_AddGCRef(ctx, &slot->inputs[0]) = result;
    future_mark_observed(input);
}

static bool future_advance_combinators(JSContext *ctx,
                                       esp32_mquickjs_runtime_t *runtime)
{
    future_runtime_t *state = future_runtime(runtime);
    uint64_t now_us = (uint64_t)esp_timer_get_time();
    bool handled = false;
    int i;

    for (i = 0; i < ESP32_MQUICKJS_FUTURE_SLOT_COUNT; ++i) {
        future_slot_t *slot = &state->slots[i];
        future_state_t before;

        if (!slot->allocated || slot->state != FUTURE_STATE_PENDING) {
            continue;
        }
        before = slot->state;
        if (slot->kind == FUTURE_KIND_ALL) {
            future_advance_all(ctx, slot);
        } else if (slot->kind == FUTURE_KIND_RACE) {
            future_advance_race(ctx, slot);
        } else if (slot->kind == FUTURE_KIND_TIMEOUT) {
            future_advance_timeout(ctx, slot, now_us);
        } else if (slot->kind == FUTURE_KIND_MAP ||
                   slot->kind == FUTURE_KIND_FLAT_MAP) {
            future_advance_continuation(ctx, runtime, slot);
        }
        handled = handled || slot->state != before;
    }
    return handled;
}

static bool future_advance_sleep_deadlines(JSContext *ctx,
                                           esp32_mquickjs_runtime_t *runtime)
{
    future_runtime_t *state = future_runtime(runtime);
    uint64_t now_us = (uint64_t)esp_timer_get_time();
    bool handled = false;
    int i;

    if (state == NULL || state->slots == NULL) {
        return false;
    }
    for (i = 0; i < ESP32_MQUICKJS_FUTURE_SLOT_COUNT; ++i) {
        future_slot_t *slot = &state->slots[i];

        if (!slot->allocated || slot->state != FUTURE_STATE_PENDING ||
            slot->kind != FUTURE_KIND_SLEEP || slot->deadline_us == 0 ||
            slot->deadline_us > now_us) {
            continue;
        }
        /*
         * The ready queue is only a latency hint. A full queue must not strand
         * a timer-backed Future after its esp_timer callback has fired.
         */
        future_settle(ctx, slot, FUTURE_STATE_FULFILLED, JS_UNDEFINED);
        handled = true;
    }
    return handled;
}

static bool future_expire_deadlines(JSContext *ctx,
                                    esp32_mquickjs_runtime_t *runtime)
{
    future_runtime_t *state = future_runtime(runtime);
    uint64_t now_us = (uint64_t)esp_timer_get_time();
    bool handled = false;
    int i;

    for (i = 0; i < ESP32_MQUICKJS_FUTURE_SLOT_COUNT; ++i) {
        future_slot_t *slot = &state->slots[i];
        char message[96];
        uint32_t timeout_ms;
        bool custom_timeout = false, timeout_rejected = false;

        if (!slot->allocated || future_is_terminal(slot->state) ||
            slot->kind == FUTURE_KIND_SLEEP || slot->kind == FUTURE_KIND_TIMEOUT ||
            slot->deadline_us == 0 || now_us < slot->deadline_us) {
            continue;
        }
        JSGCRef timeout_ref;
        JSValue *timeout_result = JS_PushGCRef(ctx, &timeout_ref);
        *timeout_result = JS_UNDEFINED;
        timeout_ms = esp32_mquickjs_future_elapsed_timeout_ms(
            slot->submitted_us, slot->deadline_us);
        if (slot->driver_active && slot->driver != NULL &&
            slot->driver->on_timeout != NULL) {
            JSValue result = slot->driver->on_timeout(
                ctx, slot->driver_state, timeout_ms);

            if (JS_IsException(result) && JS_HasException(ctx)) {
                *timeout_result = JS_GetException(ctx);
                custom_timeout = timeout_rejected = true;
            } else if (!JS_IsException(result)) {
                /* Receive-style drivers use null as a successful empty wait.
                 * Root it before native cancellation can run any cleanup. */
                *timeout_result = result;
                custom_timeout = true;
            }
        }
        if (slot->driver_active && slot->state == FUTURE_STATE_QUEUED) {
            future_destroy_driver(slot);
        } else if (slot->driver_active && slot->driver != NULL &&
                   slot->driver->cancel != NULL && !slot->cancel_requested) {
            esp32_mquickjs_cancel_result_t cancel_result =
                slot->driver->cancel(slot->driver_state);

            if (cancel_result == ESP32_MQUICKJS_CANCEL_REQUESTED) {
                slot->cancel_requested = true;
            }
        }
        if (custom_timeout) {
            future_settle(
                ctx, slot, timeout_rejected ? FUTURE_STATE_REJECTED : FUTURE_STATE_FULFILLED, *timeout_result);
        } else {
            snprintf(message, sizeof(message), "Future operation timed out after %" PRIu32 " ms", timeout_ms);
            future_reject_message(ctx, slot, message);
        }
        JS_PopGCRef(ctx, &timeout_ref);
        handled = true;
    }
    return handled;
}

