99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_future.c
static bool future_poll_ready(JSContext *ctx,
                              esp32_mquickjs_runtime_t *runtime,
                              esp32_mquickjs_future_token_t token)
{
    future_slot_t *slot = future_resolve_token(runtime, token);
    JSValue result;

    if (slot == NULL) {
        return false;
    }
    if (slot->kind == FUTURE_KIND_SLEEP) {
        if (!future_is_terminal(slot->state)) {
            future_settle(ctx, slot, FUTURE_STATE_FULFILLED, JS_UNDEFINED);
        }
        return true;
    }
    if (!slot->driver_active || slot->driver == NULL || slot->driver->poll == NULL ||
        slot->driver->poll(slot->driver_state) != ESP32_MQUICKJS_FUTURE_READY) {
        return false;
    }
    if (future_is_terminal(slot->state)) {
        future_destroy_driver(slot);
        future_publish_terminal(ctx, slot);
        future_release_if_terminal(ctx, slot);
        return true;
    }
    if (slot->cancel_requested) {
        future_destroy_driver(slot);
        future_settle(ctx, slot, FUTURE_STATE_CANCELLED, JS_UNDEFINED);
        return true;
    }
    result = slot->driver->finish(ctx, slot->driver_state);
    future_destroy_driver(slot);
    if (JS_IsException(result)) {
        future_reject_current_exception(ctx, slot);
    } else {
        future_settle(ctx, slot, FUTURE_STATE_FULFILLED, result);
    }
    return true;
}

static bool future_poll_active_drivers(JSContext *ctx,
                                       esp32_mquickjs_runtime_t *runtime)
{
    future_runtime_t *state = future_runtime(runtime);
    bool handled = false;
    int i;

    if (state == NULL || state->slots == NULL) {
        return false;
    }
    /*
     * A wake token is only a latency optimization. ISR and worker completions
     * use a bounded queue, so a full queue must not be able to strand a driver
     * that has already completed or acknowledged cancellation. Polling the
     * bounded active-slot set at each scheduler safe point also guarantees
     * teardown progress when the final wake races with runtime shutdown.
     */
    for (i = 0; i < ESP32_MQUICKJS_FUTURE_SLOT_COUNT; ++i) {
        future_slot_t *slot = &state->slots[i];

        if (!slot->allocated || !slot->driver_active ||
            slot->state == FUTURE_STATE_QUEUED) {
            continue;
        }
        handled = future_poll_ready(ctx, runtime, future_token(slot)) || handled;
    }
    return handled;
}

static bool future_dispatch_waiting_lanes(JSContext *ctx,
                                          esp32_mquickjs_runtime_t *runtime)
{
    future_runtime_t *state = future_runtime(runtime);
    bool handled = false;
    int dispatched = 0;

    if (state == NULL || state->slots == NULL) {
        return false;
    }
    while (dispatched < CONFIG_ESP32_MQUICKJS_FUTURE_DISPATCH_BATCH) {
        esp32_mquickjs_future_scheduler_slot_t
            slots[ESP32_MQUICKJS_FUTURE_SLOT_COUNT];
        future_slot_t *candidate;
        size_t candidate_index;

        future_scheduler_snapshot(state, slots);
        candidate_index = esp32_mquickjs_future_scheduler_next_waiting(
            slots, ESP32_MQUICKJS_FUTURE_SLOT_COUNT);
        if (candidate_index == ESP32_MQUICKJS_FUTURE_SCHEDULER_NO_SLOT) {
            break;
        }
        candidate = &state->slots[candidate_index];
        if (candidate->state != FUTURE_STATE_QUEUED) {
            candidate->lane_waiting = false;
            continue;
        }
        handled = future_start_captured_driver(ctx, runtime, candidate) || handled;
        dispatched++;
    }
    return handled;
}

bool esp32_mquickjs_init_future_runtime(JSContext *ctx,
                                        esp32_mquickjs_runtime_t *runtime)
{
    esp32_mquickjs_future_runtime_resources_t resources;
    future_runtime_t *state;
    int i;

    if (ctx == NULL || runtime == NULL) {
        return false;
    }
    if (runtime->future_state != NULL) {
        return true;
    }
    if (!future_init_worker_pool()) {
        return false;
    }
    if (!esp32_mquickjs_future_runtime_resources_init(
            &resources, &s_future_runtime_resource_ops, sizeof(*state),
            ESP32_MQUICKJS_FUTURE_SLOT_COUNT, sizeof(*state->slots),
            CONFIG_ESP32_MQUICKJS_FUTURE_READY_QUEUE_LEN,
            sizeof(esp32_mquickjs_future_token_t))) {
        return false;
    }
    state = resources.runtime_state;
    state->resources = resources;
    state->slots = resources.slots;
    state->submissions = resources.submissions;
    state->ready = resources.ready;
    state->ctx = ctx;
    state->running_slot = -1;
    for (i = 0; i < ESP32_MQUICKJS_FUTURE_SLOT_COUNT; ++i) {
        state->slots[i].runtime = runtime;
        state->slots[i].slot_id = (uint8_t)i;
    }
    runtime->future_state = state;
    return true;
}

bool esp32_mquickjs_prepare_future_runtime_destroy(JSContext *ctx,
                                                   esp32_mquickjs_runtime_t *runtime)
{
    future_runtime_t *state = future_runtime(runtime);
    bool driver_pending = false;
    size_t i;

    if (state == NULL) {
        return true;
    }
    state->shutting_down = true;
    for (i = 0; i < ESP32_MQUICKJS_FUTURE_SLOT_COUNT; ++i) {
        future_slot_t *slot = &state->slots[i];

        if (!slot->allocated) {
            continue;
        }
        if (slot->driver_active) {
            bool driver_ready;
            bool poll_available;

            if (slot->state == FUTURE_STATE_QUEUED) {
                future_clear_slot(ctx, slot);
                continue;
            }
            if (!future_is_terminal(slot->state) && slot->driver != NULL &&
                slot->driver->cancel != NULL && !slot->cancel_requested) {
                esp32_mquickjs_cancel_result_t cancel_result =
                    slot->driver->cancel(slot->driver_state);

                if (cancel_result == ESP32_MQUICKJS_CANCELLED) {
                    slot->state = FUTURE_STATE_CANCELLED;
                } else if (cancel_result == ESP32_MQUICKJS_CANCEL_REQUESTED) {
                    slot->cancel_requested = true;
                }
            }
            poll_available = slot->driver != NULL &&
                             slot->driver->poll != NULL;
            driver_ready = poll_available &&
                           slot->driver->poll(slot->driver_state) ==
                               ESP32_MQUICKJS_FUTURE_READY;
            if (esp32_mquickjs_future_scheduler_teardown_must_wait(
                    slot->driver_active, poll_available, driver_ready)) {
                driver_pending = true;
                continue;
            }
        }
        future_clear_slot(ctx, slot);
    }
    if (driver_pending) {
        return false;
    }
    future_clear_driver_registry(ctx, state);
    return true;
}

void esp32_mquickjs_deinit_future_runtime(esp32_mquickjs_runtime_t *runtime)
{
    future_runtime_t *state = future_runtime(runtime);
    esp32_mquickjs_future_runtime_resources_t resources;

    if (state == NULL) {
        return;
    }
    /* Normal teardown removed roots while ctx was alive. Init failure has no
     * registered methods; this also releases any remaining storage after the
     * embedding runtime has destroyed its context. */
    future_clear_driver_registry(NULL, state);
    resources = state->resources;
    runtime->future_state = NULL;
    esp32_mquickjs_future_runtime_resources_deinit(
        &resources, &s_future_runtime_resource_ops);
}

bool esp32_mquickjs_get_future_status(esp32_mquickjs_runtime_t *runtime,
                                      esp32_mquickjs_future_status_t *status)
{
    future_runtime_t *state = future_runtime(runtime);
    size_t i;

    if (status == NULL) {
        return false;
    }
    memset(status, 0, sizeof(*status));
    status->capacity = ESP32_MQUICKJS_FUTURE_SLOT_COUNT;
    status->user_capacity = CONFIG_ESP32_MQUICKJS_MAX_FUTURES;
    status->internal_reserve = CONFIG_ESP32_MQUICKJS_INTERNAL_FUTURE_RESERVE;
    if (state == NULL || state->slots == NULL) {
        return true;
    }
    for (i = 0; i < ESP32_MQUICKJS_FUTURE_SLOT_COUNT; ++i) {
        future_slot_t *slot = &state->slots[i];

        if (!slot->allocated) {
            continue;
        }
        if (slot->state == FUTURE_STATE_QUEUED) {
            status->queued++;
        } else if (slot->state == FUTURE_STATE_PENDING) {
            status->pending++;
        }
    }
    return true;
}

bool esp32_mquickjs_future_register_driver(JSContext *ctx,
                                           esp32_mquickjs_runtime_t *runtime,
                                           JSValue function,
                                           const esp32_mquickjs_future_driver_t *driver)
{
    future_runtime_t *state = future_runtime(runtime);
    future_driver_entry_t *entry;
    JSValue *rooted;
    if (ctx == NULL || state == NULL || state->shutting_down || driver == NULL || !JS_IsFunction(ctx, function)) {
        return false;
    }
    const esp32_mquickjs_future_driver_t *existing = future_find_driver(state, function);
    if (existing != NULL) return existing == driver;
    if (state->driver_count >= ESP32_MQUICKJS_FUTURE_MAX_DRIVERS) {
        ESP_LOGE(TAG,
                 "Future driver registry exhausted: count=%u capacity=%u",
                 (unsigned)state->driver_count,
                 (unsigned)ESP32_MQUICKJS_FUTURE_MAX_DRIVERS);
        return false;
    }
    future_driver_chunk_t *chunk = state->drivers;
    if (chunk == NULL || chunk->count == ESP32_MQUICKJS_FUTURE_DRIVER_CHUNK_SIZE) {
        /* Each GC reference must keep its address while registered. Grow in
         * stable bounded chunks, never realloc a live array of GC roots. */
        chunk = future_runtime_resource_allocate(1, sizeof(*chunk), NULL);
        if (chunk == NULL) {
            JS_ThrowOutOfMemory(ctx);
            return false;
        }
        chunk->next = state->drivers;
        state->drivers = chunk;
    }
    entry = &chunk->entries[chunk->count++];
    rooted = JS_AddGCRef(ctx, &entry->function);
    *rooted = function;
    entry->driver = driver;
    entry->retained = true;
    ++state->driver_count;
    return true;
}

bool esp32_mquickjs_future_wake(esp32_mquickjs_runtime_t *runtime,
                               esp32_mquickjs_future_token_t token)
{
    future_runtime_t *state = future_runtime(runtime);

    if (state == NULL || state->ready == NULL ||
        xQueueSend(state->ready, &token, 0) != pdTRUE) {
        return false;
    }
    esp32_mquickjs_notify_activity(runtime);
    return true;
}

bool esp32_mquickjs_future_wake_from_isr(esp32_mquickjs_runtime_t *runtime,
                                        esp32_mquickjs_future_token_t token,
                                        int *task_woken)
{
    future_runtime_t *state = future_runtime(runtime);
    BaseType_t woken = pdFALSE;

    if (state == NULL || state->ready == NULL ||
        xQueueSendFromISR(state->ready, &token, &woken) != pdTRUE) {
        return false;
    }
    esp32_mquickjs_notify_active_runtime_from_isr((int *)&woken);
    if (task_woken != NULL && woken == pdTRUE) {
        *task_woken = 1;
    }
    return true;
}

