99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_future.c
bool esp32_mquickjs_future_submit_worker(
    esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token,
    esp32_mquickjs_future_worker_fn_t function,
    void *opaque)
{
    future_worker_item_t item = {
        .runtime = runtime,
        .token = token,
        .function = function,
        .opaque = opaque,
        .wake_future = true,
    };

    return runtime != NULL && function != NULL &&
           s_future_worker_pool_initialized && s_future_worker_queue != NULL &&
           xQueueSend(s_future_worker_queue, &item, 0) == pdTRUE;
}

bool esp32_mquickjs_submit_background_worker(
    esp32_mquickjs_future_worker_fn_t function,
    void *opaque)
{
    future_worker_item_t item = {
        .function = function,
        .opaque = opaque,
        .wake_future = false,
    };

    return function != NULL && s_future_worker_pool_initialized &&
           s_future_worker_queue != NULL &&
           xQueueSend(s_future_worker_queue, &item, 0) == pdTRUE;
}

bool esp32_mquickjs_future_poll(JSContext *ctx,
                               esp32_mquickjs_runtime_t *runtime)
{
    future_runtime_t *state = future_runtime(runtime);
    esp32_mquickjs_future_token_t token;
    bool handled = false;
    int count = 0;

    if (ctx == NULL || state == NULL || state->shutting_down) {
        return false;
    }
    handled = future_expire_deadlines(ctx, runtime);
    handled = future_advance_sleep_deadlines(ctx, runtime) || handled;
    while (count < CONFIG_ESP32_MQUICKJS_FUTURE_DISPATCH_BATCH &&
           xQueueReceive(state->submissions, &token, 0) == pdTRUE) {
        future_slot_t *slot = future_resolve_token(runtime, token);

        if (slot != NULL) {
            future_dispatch_submission(ctx, runtime, slot);
            handled = true;
        }
        count++;
    }
    count = 0;
    while (count < CONFIG_ESP32_MQUICKJS_FUTURE_READY_BATCH &&
           xQueueReceive(state->ready, &token, 0) == pdTRUE) {
        handled = future_poll_ready(ctx, runtime, token) || handled;
        count++;
    }
    handled = future_poll_active_drivers(ctx, runtime) || handled;
    handled = future_dispatch_waiting_lanes(ctx, runtime) || handled;
    handled = future_advance_combinators(ctx, runtime) || handled;
    return handled;
}

bool esp32_mquickjs_future_cooperate(esp32_mquickjs_runtime_t *runtime)
{
    future_runtime_t *state = future_runtime(runtime);

    return state != NULL && state->ctx != NULL
        ? esp32_mquickjs_poll(state->ctx, runtime) != ESP32_MQUICKJS_POLL_NONE
        : false;
}

uint32_t esp32_mquickjs_future_next_wait_ms(esp32_mquickjs_runtime_t *runtime,
                                           uint32_t requested_ms)
{
    future_runtime_t *state = future_runtime(runtime);
    uint64_t now_us = (uint64_t)esp_timer_get_time();
    uint32_t result = requested_ms;
    int i;

    if (state == NULL) {
        return result;
    }
    if (uxQueueMessagesWaiting(state->submissions) > 0 ||
        uxQueueMessagesWaiting(state->ready) > 0) {
        return 0;
    }
    for (i = 0; i < ESP32_MQUICKJS_FUTURE_SLOT_COUNT; ++i) {
        future_slot_t *slot = &state->slots[i];
        uint64_t remaining_us;
        uint32_t remaining_ms;

        if (!slot->allocated || future_is_terminal(slot->state) || slot->deadline_us == 0) {
            continue;
        }
        if (slot->deadline_us <= now_us) {
            return 0;
        }
        remaining_us = slot->deadline_us - now_us;
        remaining_ms = (uint32_t)((remaining_us + 999ULL) / 1000ULL);
        if (result == UINT32_MAX || remaining_ms < result) {
            result = remaining_ms;
        }
    }
    return result;
}

JSValue esp32_mquickjs_future_call_and_wait(JSContext *ctx,
                                            esp32_mquickjs_runtime_t *runtime,
                                            JSValue function,
                                            JSValue this_value,
                                            int argc,
                                            JSValue *argv)
{
    JSGCRef function_ref;
    JSGCRef receiver_ref;
    JSGCRef args_ref;
    JSGCRef future_ref;
    JSGCRef result_ref;
    JSValue *rooted_function;
    JSValue *rooted_receiver;
    JSValue *args_array;
    JSValue *future;
    JSValue *result;
    JSValue return_value;
    JSValue call_args[3];
    future_runtime_t *state = future_runtime(runtime);
    future_handle_t *handle;
    int i;

    if (ctx == NULL || state == NULL || argc < 0 || (argc > 0 && argv == NULL)) {
        return JS_EXCEPTION;
    }
    rooted_function = JS_PushGCRef(ctx, &function_ref);
    rooted_receiver = JS_PushGCRef(ctx, &receiver_ref);
    args_array = JS_PushGCRef(ctx, &args_ref);
    future = JS_PushGCRef(ctx, &future_ref);
    result = JS_PushGCRef(ctx, &result_ref);
    *rooted_function = function;
    *rooted_receiver = this_value;
    *args_array = JS_NewArray(ctx, argc);
    *future = JS_UNDEFINED;
    *result = JS_EXCEPTION;
    if (JS_IsException(*args_array)) {
        goto done;
    }
    for (i = 0; i < argc; ++i) {
        if (JS_IsException(JS_SetPropertyUint32(ctx, *args_array, (uint32_t)i, argv[i]))) {
            goto done;
        }
    }
    call_args[0] = *rooted_function;
    call_args[1] = *rooted_receiver;
    call_args[2] = *args_array;
    state->internal_allocation_depth++;
    *future = js_future_call(ctx, NULL, 3, call_args);
    state->internal_allocation_depth--;
    if (JS_IsException(*future)) {
        goto done;
    }
    *result = js_future_wait(ctx, future, 0, NULL);
    handle = JS_GetOpaque(ctx, *future);
    if (handle != NULL) {
        JS_SetOpaque(ctx, *future, NULL);
        js_future_finalizer(ctx, handle);
    }

done:
    return_value = JS_PopGCRef(ctx, &result_ref);
    JS_PopGCRef(ctx, &future_ref);
    JS_PopGCRef(ctx, &args_ref);
    JS_PopGCRef(ctx, &receiver_ref);
    JS_PopGCRef(ctx, &function_ref);
    return return_value;
}

JSValue js_future_constructor(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_ThrowTypeError(ctx, "Future cannot be constructed directly");
}

void js_future_finalizer(JSContext *ctx, void *opaque)
{
    future_handle_t *handle = opaque;
    future_slot_t *slot;

    if (handle == NULL) {
        return;
    }
    slot = future_handle_slot(handle);
    if (slot != NULL && slot->handle == handle) {
        slot->handle = NULL;
        future_release_if_terminal(ctx, slot);
    }
    future_report_unobserved(ctx, handle);
    handle->result = JS_UNDEFINED;
    handle->result_retained = false;
    esp32_mquickjs_memory_payload_free(handle);
}

void js_future_gc_trace(JSContext *ctx, void *opaque,
                        JSCGCVisitor visit, void *visitor_opaque)
{
    future_handle_t *handle = opaque;

    (void)ctx;
    if (handle != NULL && handle->result_retained) {
        visit(visitor_opaque, &handle->result);
    }
}

JSValue js_future_call(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_runtime_t *runtime = esp32_mquickjs_get_active_runtime();
    future_runtime_t *state = future_runtime(runtime);
    JSGCRef function_ref;
    JSGCRef receiver_ref;
    JSGCRef args_ref;
    JSGCRef result_ref;
    JSValue *function = JS_PushGCRef(ctx, &function_ref);
    JSValue *receiver = JS_PushGCRef(ctx, &receiver_ref);
    JSValue *args = JS_PushGCRef(ctx, &args_ref);
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    future_slot_t *slot;
    JSValue return_value;

    (void)this_val;
    *function = argc >= 1 ? argv[0] : JS_UNDEFINED;
    *receiver = argc >= 2 && !JS_IsUndefined(argv[1])
        ? argv[1] : JS_GetGlobalObject(ctx);
    *args = argc >= 3 ? argv[2] : JS_UNDEFINED;
    *result = JS_EXCEPTION;
    if (argc < 1 || argc > 3 || !JS_IsFunction(ctx, *function)) {
        *result = JS_ThrowTypeError(ctx,
                                    "Future.call(fn, thisValue?, args?) expects a function");
        goto done;
    }
    slot = future_allocate_slot(runtime, FUTURE_KIND_CALL);
    if (slot == NULL) {
        *result = JS_ThrowInternalError(ctx, "Future capacity is exhausted");
        goto done;
    }
    const esp32_mquickjs_future_driver_t *driver = future_find_driver(state, *function);
    if (driver != NULL && driver->memory_owner != NULL) slot->memory_owner = driver->memory_owner;
    if (!future_retain_call(ctx,
                            slot,
                            *function,
                            *receiver,
                            *args)) {
        future_clear_slot(ctx, slot);
        goto done;
    }
    *result = future_make_handle(ctx, slot);
    if (JS_IsException(*result)) {
        goto done;
    }
    if (!future_capture_call_driver(ctx, state, slot)) {
        goto done;
    }
    if (!future_submit(slot)) {
        future_abandon_handle(slot);
        future_clear_slot(ctx, slot);
        *result = JS_ThrowInternalError(ctx, "Future submission queue is full");
    }

done:
    return_value = JS_PopGCRef(ctx, &result_ref);
    JS_PopGCRef(ctx, &args_ref);
    JS_PopGCRef(ctx, &receiver_ref);
    JS_PopGCRef(ctx, &function_ref);
    return return_value;
}

