99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_future.c
static JSValue future_make_combinator(JSContext *ctx,
                                      JSValue inputs,
                                      future_kind_t kind,
                                      bool allow_empty)
{
    esp32_mquickjs_runtime_t *runtime = esp32_mquickjs_get_active_runtime();
    JSGCRef inputs_ref;
    JSValue *rooted_inputs = JS_PushGCRef(ctx, &inputs_ref);
    future_slot_t *slot;
    JSValue result;

    *rooted_inputs = inputs;
    slot = future_allocate_slot(runtime, kind);
    if (slot == NULL) {
        result = JS_ThrowInternalError(ctx, "Future capacity is exhausted");
        goto done;
    }
    if (!future_retain_inputs(ctx, slot, *rooted_inputs, allow_empty)) {
        future_clear_slot(ctx, slot);
        result = JS_EXCEPTION;
        goto done;
    }
    result = future_make_handle(ctx, slot);
    if (JS_IsException(result)) {
        goto done;
    }
    if (!future_submit(slot)) {
        future_abandon_handle(slot);
        future_clear_slot(ctx, slot);
        result = JS_ThrowInternalError(ctx, "Future submission queue is full");
    } else {
        future_observe_inputs(ctx, slot);
    }

done:
    JS_PopGCRef(ctx, &inputs_ref);
    return result;
}

JSValue js_future_all(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    if (argc != 1) {
        return JS_ThrowTypeError(ctx, "Future.all(futures) expects one array");
    }
    return future_make_combinator(ctx, argv[0], FUTURE_KIND_ALL, true);
}

JSValue js_future_race(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    if (argc != 1) {
        return JS_ThrowTypeError(ctx, "Future.race(futures) expects one array");
    }
    return future_make_combinator(ctx, argv[0], FUTURE_KIND_RACE, false);
}

JSValue js_future_sleep(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_runtime_t *runtime = esp32_mquickjs_get_active_runtime();
    future_slot_t *slot;
    int delay_ms;
    JSValue result;

    (void)this_val;
    if (argc != 1 || JS_ToInt32(ctx, &delay_ms, argv[0]) != 0 || delay_ms < 0) {
        return JS_ThrowTypeError(ctx, "Future.sleep(ms) expects a non-negative integer");
    }
    slot = future_allocate_slot(runtime, FUTURE_KIND_SLEEP);
    if (slot == NULL) {
        return JS_ThrowInternalError(ctx, "Future capacity is exhausted");
    }
    slot->deadline_us = slot->submitted_us + ((uint64_t)(uint32_t)delay_ms * 1000ULL);
    result = future_make_handle(ctx, slot);
    if (JS_IsException(result)) {
        return result;
    }
    if (!future_submit(slot)) {
        future_abandon_handle(slot);
        future_clear_slot(ctx, slot);
        return JS_ThrowInternalError(ctx, "Future submission queue is full");
    }
    return result;
}

JSValue js_future_timeout(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_runtime_t *runtime = esp32_mquickjs_get_active_runtime();
    future_slot_t *slot;
    JSGCRef inputs_ref;
    JSValue *inputs;
    JSValue result;
    uint32_t timeout_ms;

    (void)this_val;
    if (argc != 2 || future_handle_from_value(ctx, argv[0]) == NULL ||
        !esp32_mquickjs_value_to_bounded_u32(
            ctx, argv[1], 0, INT32_MAX, &timeout_ms)) {
        return JS_ThrowTypeError(ctx, "Future.timeout(future, timeoutMs) expects a Future and non-negative integer");
    }
    slot = future_allocate_slot(runtime, FUTURE_KIND_TIMEOUT);
    if (slot == NULL) {
        return JS_ThrowInternalError(ctx, "Future capacity is exhausted");
    }
    inputs = JS_PushGCRef(ctx, &inputs_ref);
    *inputs = JS_NewArray(ctx, 1);
    if (JS_IsException(*inputs) || JS_IsException(JS_SetPropertyUint32(ctx, *inputs, 0, argv[0])) ||
        !future_retain_inputs(ctx, slot, *inputs, false)) {
        JS_PopGCRef(ctx, &inputs_ref);
        future_clear_slot(ctx, slot);
        return JS_EXCEPTION;
    }
    JS_PopGCRef(ctx, &inputs_ref);
    slot->deadline_us = slot->submitted_us +
                        ((uint64_t)timeout_ms * 1000ULL);
    result = future_make_handle(ctx, slot);
    if (JS_IsException(result)) {
        return result;
    }
    if (!future_submit(slot)) {
        future_abandon_handle(slot);
        future_clear_slot(ctx, slot);
        return JS_ThrowInternalError(ctx, "Future submission queue is full");
    }
    future_observe_inputs(ctx, slot);
    return result;
}

static JSValue future_make_continuation(JSContext *ctx,
                                        JSValue *this_val,
                                        int argc,
                                        JSValue *argv,
                                        future_kind_t kind,
                                        const char *api_name)
{
    esp32_mquickjs_runtime_t *runtime = esp32_mquickjs_get_active_runtime();
    future_handle_t *input = future_this_handle(ctx, this_val, api_name);
    future_slot_t *slot;
    JSValue result;

    if (input == NULL) {
        return JS_EXCEPTION;
    }
    if (argc != 1 || !JS_IsFunction(ctx, argv[0])) {
        return JS_ThrowTypeError(ctx, "%s expects one function", api_name);
    }
    slot = future_allocate_slot(runtime, kind);
    if (slot == NULL) {
        return JS_ThrowInternalError(ctx, "Future capacity is exhausted");
    }
    if (!future_retain_continuation(ctx, slot, *this_val, argv[0])) {
        future_clear_slot(ctx, slot);
        return JS_EXCEPTION;
    }
    result = future_make_handle(ctx, slot);
    if (JS_IsException(result)) {
        return result;
    }
    if (!future_submit(slot)) {
        future_abandon_handle(slot);
        future_clear_slot(ctx, slot);
        return JS_ThrowInternalError(ctx, "Future submission queue is full");
    }
    future_observe_inputs(ctx, slot);
    return result;
}

JSValue js_future_map(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    return future_make_continuation(ctx, this_val, argc, argv,
                                    FUTURE_KIND_MAP, "future.map()");
}

