99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_future.c
JSValue js_future_flat_map(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    return future_make_continuation(ctx, this_val, argc, argv,
                                    FUTURE_KIND_FLAT_MAP, "future.flatMap()");
}

JSValue js_future_status(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    future_handle_t *handle = future_this_handle(ctx, this_val, "future.status()");

    (void)argc;
    (void)argv;
    return handle != NULL
        ? JS_NewString(ctx, future_state_name(future_handle_state(handle)))
        : JS_EXCEPTION;
}

JSValue js_future_wait(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_runtime_t *runtime = esp32_mquickjs_get_active_runtime();
    future_handle_t *handle = future_this_handle(ctx, this_val, "future.wait()");
    esp32_mquickjs_native_wait_t native_wait;
    uint64_t wait_deadline_us = 0;
    uint32_t timeout_ms = 0;
    JSValue result;

    if (handle == NULL) {
        return JS_EXCEPTION;
    }
    if (argc > 1 ||
        (argc == 1 && !esp32_mquickjs_value_to_bounded_u32(
            ctx, argv[0], 0, INT32_MAX, &timeout_ms))) {
        return JS_ThrowTypeError(ctx, "future.wait(timeoutMs?) expects a non-negative integer");
    }
    if (argc == 1) {
        wait_deadline_us = (uint64_t)esp_timer_get_time() +
                           ((uint64_t)timeout_ms * 1000ULL);
    }
    future_mark_observed(handle);
    esp32_mquickjs_native_wait_begin(runtime, &native_wait);
    while (!handle->terminal) {
        esp32_mquickjs_poll_result_t poll_result;
        uint32_t wait_ms = ESP32_MQUICKJS_COOPERATIVE_WAIT_SLICE_MS;
        uint64_t now_us;

        if (future_handle_slot(handle) == NULL) {
            result = JS_ThrowInternalError(ctx, "future.wait() lost its operation");
            goto done;
        }

        poll_result = esp32_mquickjs_poll(ctx, runtime);
        if (handle->terminal) {
            break;
        }
        now_us = (uint64_t)esp_timer_get_time();
        if (wait_deadline_us > 0 && now_us >= wait_deadline_us) {
            result = JS_ThrowInternalError(
                ctx, "future.wait() timed out after %" PRIu32 " ms",
                timeout_ms);
            goto done;
        }
        if (!esp32_mquickjs_cooperate(runtime)) {
            result = JS_ThrowInternalError(
                ctx, "future.wait() was interrupted by a runtime stop request");
            goto done;
        }
        if (poll_result != ESP32_MQUICKJS_POLL_NONE) {
            continue;
        }
        if (wait_deadline_us > now_us) {
            uint64_t remaining_us = wait_deadline_us - now_us;
            uint32_t remaining_ms = (uint32_t)((remaining_us + 999ULL) / 1000ULL);

            if (remaining_ms < wait_ms) {
                wait_ms = remaining_ms;
            }
        }
        wait_ms = esp32_mquickjs_future_next_wait_ms(runtime, wait_ms);
        if (wait_ms == 0) {
            continue;
        }
        (void)esp32_mquickjs_wait_for_activity(runtime, wait_ms);
    }
    if (handle->state == FUTURE_STATE_FULFILLED) {
        result = handle->result;
    } else if (handle->state == FUTURE_STATE_REJECTED) {
        result = JS_Throw(ctx, handle->result);
    } else {
        result = JS_ThrowInternalError(ctx, "future.wait() was cancelled");
    }

done:
    esp32_mquickjs_native_wait_end(runtime, &native_wait);
    return result;
}

JSValue js_future_cancel(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    future_handle_t *handle = future_this_handle(ctx, this_val, "future.cancel()");
    future_slot_t *slot;

    (void)argc;
    (void)argv;
    if (handle == NULL) {
        return JS_EXCEPTION;
    }
    future_mark_observed(handle);
    slot = future_handle_slot(handle);
    return JS_NewBool(slot != NULL && future_cancel_slot(ctx, slot));
}
